# 샵 표시는 프로그래밍에서 주서깅라 말한다.
# 주석은 파이썬의 인터프리터가 인식하지 못하도록 하는 기호
# 단축키는 ctrl 슬래시

# 아래 a = 1의 의미는 a와 1이 같다라는 의미가 아니라,
# a라는 이름의 변수에 1을 담겠다는 뜻.
a = 1
b = "1"

#print는 실행 후 결과값을 가시적으로 보여주기 위해 터미널차에 출력하는 것 
print(a)
print(b)

a = a + 1
print(a)

# 변수명명규칙
# 변수명을 지을 떄는 숫자가 먼저 나와서는 안된다.
# 변수명 중간에 띄어쓰기, 득수기호등을 일반적으로 쓰지 않는다.

# 변수 자료형 출력해보기
# int = integer 정수
print(type(a))

# str = string 문자열

print(type(b))

# Float = 실수
c = 2.1
print(type(c))

# 사칙연산
# 덧셈: +, 뺄셈: -, 곱셈: *(asteris or all 모든 것을 의미하기도 함), 나눗셈: /

